app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "description", "brand", "quantity", "price", "decimal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)