app/controllers/warehouses_controller.rb

  def create
    @warehouse = Warehouse.new(location: warehouse_params[:location], postal_code: warehouse_params[:postal_code])
    id_arr = warehouse_params['productIds'].split(';')
    @warehouse.product_ids = id_arr

    if @warehouse.save
---
INSERT INTO "warehouses" ("location", "postal_code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", "location5"], ["postal_code", "postal1"], ["created_at", "2022-01-16 19:16:12.583311"], ["updated_at", "2022-01-16 19:16:12.583311"]]

  def edit
    @warehouse = Warehouse.find(params[:id])
    @selected_products = @warehouse.products.ids.join(";")
---
SELECT "products"."id" FROM "products" INNER JOIN "assignments" ON "products"."id" = "assignments"."product_id" WHERE "assignments"."warehouse_id" = ?  [["warehouse_id", 2]]

  def update
    @warehouse = Warehouse.find(params[:id])
    id_arr = warehouse_params['productIds'].split(';')
    @warehouse.product_ids = id_arr
    @warehouse.location = warehouse_params[:location]
    @warehouse.postal_code = warehouse_params[:postal_code]

    if @warehouse.save
---
UPDATE "warehouses" SET "location" = ?, "updated_at" = ? WHERE "warehouses"."id" = ?  [["location", "location50"], ["updated_at", "2022-01-16 19:24:04.637387"], ["id", 3]]